<a href="https://colab.research.google.com/github/mradulpandya/Data_Analysis/blob/main/Working_with_different_files_type.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [51]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# Reading and Writing Text Files

In [2]:
dframe = pd.read_csv('demo.csv')

In [3]:
dframe

   1  2  3  4   apple
0  a  b  c  d  banana
1  5  6  7  8  orange
2  e  f  g  h   mango

In [5]:
dframe = pd.read_csv('demo.csv', header = None)

In [6]:
dframe

   0  1  2  3       4
0  1  2  3  4   apple
1  a  b  c  d  banana
2  5  6  7  8  orange
3  e  f  g  h   mango

In [7]:
dframe = pd.read_csv('demo.csv',sep=',', header = None)

In [8]:
dframe

   0  1  2  3       4
0  1  2  3  4   apple
1  a  b  c  d  banana
2  5  6  7  8  orange
3  e  f  g  h   mango

In [9]:
dframe = pd.read_csv('demo.csv', header = None, nrows=2)

In [10]:
dframe

   0  1  2  3       4
0  1  2  3  4   apple
1  a  b  c  d  banana

In [11]:
#exporting csv file
dframe.to_csv('mytext.csv')

In [12]:
import sys

In [13]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,1,2,3,4,apple
1,a,b,c,d,banana

In [14]:
dframe.to_csv(sys.stdout, sep='_')

_0_1_2_3_4
0_1_2_3_4_apple
1_a_b_c_d_banana

In [16]:
dframe.to_csv(sys.stdout, columns=[0,1])

,0,1
0,1,2
1,a,b

# JSON With Python

In [17]:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [18]:
import json

In [19]:
data = json.loads(json_obj)

In [20]:
data

{'clothes': None,
 'diet': [{'food': 'grass', 'fur': 'Brown', 'zoo_animal': 'Gazelle'}],
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'zoo_animal': 'Lion'}

In [21]:
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [22]:
dframe = DataFrame(data['diet'])

In [24]:
dframe

  zoo_animal   food    fur
0    Gazelle  grass  Brown

#HTML With Python

In [39]:
from pandas import read_html
from bs4 import BeautifulSoup
import html5lib

In [44]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

In [ ]:
dframe_list = pd.io.html.read_html(url)

# Microsoft Excel File With Python

In [50]:
import xlrd
from openpyxl import workbook

In [54]:
xlsfile = pd.ExcelFile('demo.xlsx')

In [57]:
dframe = xlsfile.parse('Sheet1')

In [58]:
dframe

   Unnamed: 0  This is a test  Unnamed: 1  Unnamed: 2
0           0              23        6678         456
1           1             234         678         456
2           2             234           7         345
3           3              34          56         234
4           4               5         456        4365